Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetUserPropertyItems Method (CatalogObjectTypeEnum)
 Returns an enumerator of user property items of the given object type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserPropertyItemEnumerator GetUserPropertyItems(
	CatalogObjectTypeEnum objectType
)
Public Function GetUserPropertyItems (
	objectType As CatalogObjectTypeEnum
) As UserPropertyItemEnumerator
Parameters
objectType
Type: Tekla.Structures.Catalogs.CatalogObjectTypeEnum
The object type to be used.
Return Value
Type: UserPropertyItemEnumerator
A UserPropertyItemEnumerator of user property items of the given object type.
See Also
Reference
CatalogHandler Class
GetUserPropertyItems Overload
Tekla.Structures.Catalogs Namespace